gbs_ogl_cbs_interface/data/SingleDebitMultipleCredit/SingleDebitMultipleCredit/SingleDebitMultiCredit/SingleDebitMultiCreditInterface.wsdl

<?xml version="1.0" encoding="UTF-8"?><definitions targetNamespace="http://BaNCS.TCS.com/webservice/SingleDebitMultiCreditInterface/v1" xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:tns="http://BaNCS.TCS.com/webservice/SingleDebitMultiCreditInterface/v1" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <types>
    <xsd:schema>
      <xsd:import namespace="http://TCS.BANCS.Adapter/BANCSSchema" schemaLocation="SingleDebitMultiCreditInterface_schema1.xsd"/>
    </xsd:schema>
    <xsd:schema>
      <xsd:import namespace="http://BaNCS.TCS.com/webservice/SingleDebitMultiCreditInterface/v1" schemaLocation="SingleDebitMultiCreditInterface_schema2.xsd"/>
    </xsd:schema>
  </types>
  <message name="singleDebitMultiCredit">
    <part element="tns:singleDebitMultiCredit" name="parameters"/>
  </message>
  <message name="singleDebitMultiCreditResponse">
    <part element="tns:singleDebitMultiCreditResponse" name="parameters"/>
  </message>
  <message name="SingleDebitMultiCreditFaultMsg">
    <part element="tns:string_element" name="fault"/>
  </message>
  <portType name="SingleDebitMultiCreditInterface">
    <operation name="singleDebitMultiCredit">
      <input message="tns:singleDebitMultiCredit"/>
      <output message="tns:singleDebitMultiCreditResponse"/>
      <fault message="tns:SingleDebitMultiCreditFaultMsg" name="SingleDebitMultiCreditFaultMsg"/>
    </operation>
  </portType>
</definitions>
